<?php die(); // == Модуль == //
// === #Manul:F# ================================================================ Функции ============================= //
// === #Manul:P# ================================================================ Преддизайновые действия ============= //
// === #Manul:I# ================================================================ Первичные действия ================== //
// === #Manul:A# ================================================================ Действия пользователя =============== //

// == Вычисление таймингов == //
$scene=json_decode($_POST["scene"], true);  // Парсим json сцену
$frames_col=$scene["properties"]["interval"]/$scene["properties"]["step"];  // Вычисляем количество кадров
$entity_col=count($scene["entities"]);  // Вычисляем количество сущностей
for($i=1; $i<=$frames_col; $i++)  // Идём цикл по кадрам
  for($j=1; $j<=$entity_col; $j++) {  // Идём цикл по сущностям
    $scene["frames"]["f".$i]["e".$j]["x"]=$scene["entities"]["e".$j]["x"];  // Задаём координату x в данном кадре
    $scene["frames"]["f".$i]["e".$j]["y"]=$scene["entities"]["e".$j]["y"]+$k*$scene["properties"]["gravity"]*$scene["properties"]["step"];	// Задаём координату y в данном кадре
    $k++;
  }
mn_return(json_encode($scene));  // Возвращаем массив в виде json

// === #Manul:V# ================================================================ Визуальные элементы ================= //
// === #Manul:H# ================================================================ HTML ================================ //
// === #Manul:J# ================================================================ Javascript =============== // ?><script>
// === #Manul:C# ================================================================ CSS ================================= //